## Terraform Plan Result


### environments/stg/app/asg
```
  + create
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = true
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "stg-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + region                           = "ap-southeast-2"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:ap-southeast-2:676259472245:targetgroup/stg-tg/4a9de1935b995264",
      + vpc_zone_identifier              = [
          + "subnet-06a9715f308f0affa",
          + "subnet-0e86473a93127eaf4",
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)
      + availability_zone_distribution (known after apply)
      + capacity_reservation_specification (known after apply)
      + launch_template {
          + id      = "lt-0bb5ccbf8366a47b5"
          + name    = (known after apply)
          + version = "$Latest"
      + mixed_instances_policy (known after apply)
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "stg-asg"
      + traffic_source (known after apply)
  + resource "aws_autoscaling_policy" "cpu_target" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = "stg-asg"
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "stg-asg-cpu-scaling"
      + policy_type             = "TargetTrackingScaling"
      + region                  = "ap-southeast-2"
      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 50
          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
Plan: 2 to add, 0 to change, 0 to destroy.
Changes to Outputs:
  + asg_arn  = (known after apply)
  + asg_name = "stg-asg"
```
<!-- Sticky Pull Request Commentterraform-plan -->